tlaplus/state-diagram.dot
digraph StateDiagram {
    rankdir=LR;

    Start [shape = "point"]
    Start -> NotMember
    NotMember -> Fenced [label = "NewTerm"]

    Fenced -> Fenced [label = "NewTerm"];
    Fenced -> Follower [label = "Replicate"]
    Fenced -> Follower [label = "Truncate"]

    Follower -> Fenced [label = "NewTerm"]
    Leader -> Fenced [label = "NewTerm"]
    Leader -> Leader [label = "AddFollower"]
    Follower -> Follower [label = "Replicate"]
    Fenced -> Leader [label = "BecomeLeader"]

    Fenced -> Follower [label = "Snapshot"]
    Follower -> Follower [label = "Snapshot"]
}
